## Titanic Dataset Analysis

#### Set Up

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

#### Data Pre Processing

In [2]:
train_df = pd.read_csv("data/train.csv")
test_df = pd.read_csv("data/test.csv")

In [9]:
train_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [8]:
train_df.drop(columns=["PassengerId", "Name", "Ticket"], axis=1, inplace=True)
test_df.drop(columns=["PassengerId", "Name", "Ticket"], axis=1, inplace=True)